## Terraform Plan — production
<details><summary>Show Plan</summary>

```
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
environments/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/testing-cloudflare-worker/testing-cloudflare-worker/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/testing-cloudflare-worker/testing-cloudflare-worker

To view this run in a browser, visit:
https://app.terraform.io/app/answer-me/answer-me-production/runs/run-Xyy4tphVRXpzEqqn

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
cloudflare_d1_database.this: Refreshing state... [id=37e7786e-780f-43b3-815c-d2cf10219883]
module.worker.cloudflare_worker.this: Refreshing state... [id=4bd68027fd304004a0544a86f87dc2ba]
module.worker.cloudflare_worker_version.this: Refreshing state... [id=5dea2f8b-512a-465a-a82a-a2fc8b589f91]
module.worker.cloudflare_workers_deployment.this: Refreshing state... [id=1f72ed40-126a-44b1-b2b9-77f0833cf1ac]
module.worker.cloudflare_workers_deployment.this: Drift detected (update)
cloudflare_d1_database.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = [ # forces replacement
          ~ {
                name = "GOOGLE_API_KEY"
              ~ text = (sensitive value)
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
      ~ created_on          = "2026-02-26T15:26:55Z" -> (known after apply)
      ~ id                  = "5dea2f8b-512a-465a-a82a-a2fc8b589f91" -> (known after apply)
      + limits              = (known after apply)
      + main_script_base64  = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "dist/index.js" -> null
              - content_sha256 = "4ed3cce01fe198c188753a9d8f3e565eced98ec5b6424c50983330567f7faac5" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "dist/index.js"
              + content_sha256 = "879909ec6f7bf6450efafa4f79e6c3e8b9d74218a815403280117e9dfa8cd383"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 1 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 11 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-26T15:26:56Z" -> (known after apply)
      ~ id           = "1f72ed40-126a-44b1-b2b9-77f0833cf1ac" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "5dea2f8b-512a-465a-a82a-a2fc8b589f91" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>